NordicSemiconductor/nrfx/bsp/stable/mdk/arm_startup_nrf54lc10a_application.s
; Reset Handler


Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main


                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemoryManagement_Handler\
                PROC
                EXPORT  MemoryManagement_Handler  [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler               [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler           [WEAK]
                B       .
                ENDP

Default_Handler PROC

                EXPORT   SWI00_IRQHandler [WEAK]
                EXPORT   SWI01_IRQHandler [WEAK]
                EXPORT   SWI02_IRQHandler [WEAK]
                EXPORT   SWI03_IRQHandler [WEAK]
                EXPORT   SPU00_IRQHandler [WEAK]
                EXPORT   MPC00_IRQHandler [WEAK]
                EXPORT   AAR00_CCM00_IRQHandler [WEAK]
                EXPORT   ECB00_IRQHandler [WEAK]
                EXPORT   VPR00_IRQHandler [WEAK]
                EXPORT   RRAMC_IRQHandler [WEAK]
                EXPORT   CTRLAP_IRQHandler [WEAK]
                EXPORT   CM33SS_IRQHandler [WEAK]
                EXPORT   TIMER00_IRQHandler [WEAK]
                EXPORT   EGU00_IRQHandler [WEAK]
                EXPORT   CRACEN_IRQHandler [WEAK]
                EXPORT   SPU10_IRQHandler [WEAK]
                EXPORT   TIMER10_IRQHandler [WEAK]
                EXPORT   EGU10_IRQHandler [WEAK]
                EXPORT   RADIO_0_IRQHandler [WEAK]
                EXPORT   RADIO_1_IRQHandler [WEAK]
                EXPORT   SPU20_IRQHandler [WEAK]
                EXPORT   SERIAL20_IRQHandler [WEAK]
                EXPORT   SERIAL21_IRQHandler [WEAK]
                EXPORT   EGU20_IRQHandler [WEAK]
                EXPORT   TIMER20_IRQHandler [WEAK]
                EXPORT   TIMER21_IRQHandler [WEAK]
                EXPORT   TIMER22_IRQHandler [WEAK]
                EXPORT   TIMER23_IRQHandler [WEAK]
                EXPORT   TIMER24_IRQHandler [WEAK]
                EXPORT   SAADC_IRQHandler [WEAK]
                EXPORT   TEMP_IRQHandler [WEAK]
                EXPORT   GPIOTE20_0_IRQHandler [WEAK]
                EXPORT   GPIOTE20_1_IRQHandler [WEAK]
                EXPORT   GRTC_0_IRQHandler [WEAK]
                EXPORT   GRTC_1_IRQHandler [WEAK]
                EXPORT   GRTC_2_IRQHandler [WEAK]
                EXPORT   GRTC_3_IRQHandler [WEAK]
                EXPORT   TAMPC_IRQHandler [WEAK]
                EXPORT   SPU30_IRQHandler [WEAK]
                EXPORT   SERIAL30_IRQHandler [WEAK]
                EXPORT   COMP_LPCOMP_IRQHandler [WEAK]
                EXPORT   WDT30_IRQHandler [WEAK]
                EXPORT   WDT31_IRQHandler [WEAK]
                EXPORT   GPIOTE30_0_IRQHandler [WEAK]
                EXPORT   GPIOTE30_1_IRQHandler [WEAK]
                EXPORT   CLOCK_POWER_IRQHandler [WEAK]
SWI00_IRQHandler
SWI01_IRQHandler
SWI02_IRQHandler
SWI03_IRQHandler
SPU00_IRQHandler
MPC00_IRQHandler
AAR00_CCM00_IRQHandler
ECB00_IRQHandler
VPR00_IRQHandler
RRAMC_IRQHandler
CTRLAP_IRQHandler
CM33SS_IRQHandler
TIMER00_IRQHandler
EGU00_IRQHandler
CRACEN_IRQHandler
SPU10_IRQHandler
TIMER10_IRQHandler
EGU10_IRQHandler
RADIO_0_IRQHandler
RADIO_1_IRQHandler
SPU20_IRQHandler
SERIAL20_IRQHandler
SERIAL21_IRQHandler
EGU20_IRQHandler
TIMER20_IRQHandler
TIMER21_IRQHandler
TIMER22_IRQHandler
TIMER23_IRQHandler
TIMER24_IRQHandler
SAADC_IRQHandler
TEMP_IRQHandler
GPIOTE20_0_IRQHandler
GPIOTE20_1_IRQHandler
GRTC_0_IRQHandler
GRTC_1_IRQHandler
GRTC_2_IRQHandler
GRTC_3_IRQHandler
TAMPC_IRQHandler
SPU30_IRQHandler
SERIAL30_IRQHandler
COMP_LPCOMP_IRQHandler
WDT30_IRQHandler
WDT31_IRQHandler
GPIOTE30_0_IRQHandler
GPIOTE30_1_IRQHandler
CLOCK_POWER_IRQHandler
                B .
                ENDP
                ALIGN

; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap PROC

                LDR     R0, = Heap_Mem
                LDR     R1, = (Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem + Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR
                ENDP

                ALIGN

                ENDIF

                END
